const arkhangelsk = [
  {
    "hc-a2": [
        "АГКБ7"
    ],
    "name": "ГБУЗ \" АГКБ № 7\"",
    "id": 418,
    "x": -3,
    "y": 0,
    "value": -1
  },
  {
    "hc-a2": [
        "АГКБ4"
    ],
    "name": "ГБУЗ АО \"Архангельская городская клиническая больница № 4\"",
    "id": 462,
    "x": -3,
    "y": 1,
    "value": -1
  },
  {
    "hc-a2": [
        "АГКП2"
    ],
    "name": "ГБУЗ АО \"Архангельская городская клиническая поликлиника № 2\"",
    "id": 478,
    "x": -3,
    "y": 2,
    "value": -1
  },
  {
      "hc-a2": [
          "АОДКБ"
      ],
      "name": "ГБУЗ АО \"АОДКБ\"",
      "id": 485,
      "x": -3,
      "y": 3,
      "value": -1
  },
  {
    "hc-a2": [
        "ПРИМ"
    ],
    "name": "ГБУЗ Архангельской области \"Приморская ЦРБ\"",
    "id": 513,
    "x": -3,
    "y": 4,
    "value": -1
  },
  {
    "hc-a2": [
        "АГКБ6"
    ],
    "name": "ГБУЗ АО \"Архангельская городская клиническая больница № 6\"",
    "id": 521,
    "x": -4,
    "y": 0,
    "value": -1
  },
  {
    "hc-a2": [
        "АОКСП"
    ],
    "name": "ГАУЗ Архангельской области \"АОКСП\"",
    "id": 538,
    "x": -4,
    "y": 1,
    "value": -1
  },
  {
    "hc-a2": [
        "НЦГБ"
    ],
    "name": "ГБУЗ Архангельской области \"НЦГБ\"",
    "id": 549,
    "x": -4,
    "y": 2,
    "value": -1
  },
  {
    "hc-a2": "ЦМСЧ58",
    "name": "ЦМСЧ №58",
    "id": 611,
    "x": -4,
    "y": 3,
    "value": -1
  },
  {
    "hc-a2": [
        "АОКБ"
    ],
    "name": "ГБУЗ АО \"АОКБ\"",
    "id": 615,
    "x": -4,
    "y": 4,
    "value": -1
  },
  {
    "hc-a2": [
        "1ГКБ"
    ],
    "name": "ГБУЗ Архангельской области \"Первая ГКБ им. Е.Е. Волосевич\"",
    "id": 618,
    "x": -5,
    "y": 0,
    "value": -1
  },
  {
    "hc-a2": "СЕМ",
    "name": "Семашко",
    "id": 621,
    "x": -5,
    "y": 1,
    "value": -1
  },
  {
    "hc-a2": [
        "АКОД"
    ],
    "name": "ГБУ АО \"АКОД\"",
    "id": 637,
    "x": -5,
    "y": 2,
    "value": -1
  },
  {
    "hc-a2": [
        "АКОБ"
    ],
    "name": "ГАУЗ АО \"АКОБ\"",
    "id": 638,
    "x": -5,
    "y": 3,
    "value": -1
  },
  {
    "hc-a2": [
        "АККВД"
    ],
    "name": "ГАУЗ АО \"АККВД\"",
    "id": 599,
    "x": -5,
    "y": 4,
    "value": -1
  },
  {
    "hc-a2": [
        "АКПТД"
    ],
    "name": "ГБУЗ АО \"АКПТД\"",
    "id": 601,
    "x": -6,
    "y": 0,
    "value": -1
  },
  {
    "hc-a2": [
        "АДСП"
    ],
    "name": "ГАУЗ Архангельской области \"Архангельская детская стоматологическая поликлиника\"",
    "id": 603,
    "x": -6,
    "y": 1,
    "value": -1
  },
  {
    "hc-a2": [
      "АКПБ"
    ],
    "name": "ГБУЗ Архангельской области \"АКПБ\"",
    "id": 561,
    "x": -6,
    "y": 2,
    "value": -1
  },
  {
    "hc-a2": [
      "АЦЛФиСМ"
    ],
    "name": "ГБУЗ АО \"АЦЛФ и СМ\"",
    "id": 564,
    "x": -6,
    "y": 3,
    "value": -1
  },
  {
  "hc-a2": [
    "АГДКП"
  ],
  "name": "ГБУЗ Архангельской области \"АГДКП\"",
  "id": 573,
  "x": -6,
  "y": 4,
  "value": -1
  },
  {
  "hc-a2": [
    "АГКП1"
  ],
  "name": "ГБУЗ Архангельской области \"Архангельская городская клиническая поликлиника № 1\"",
  "id": 590,
  "x": -7,
  "y": 0,
  "value": -1
  },
]

const severodvinsk = [
  {
    "hc-a2": [
      "СГКБ2"
    ],
    "name": "ГБУЗ Архангельской области \"СГКБ № 2 СМП\"",
    "id": 422,
    "x": 2,
    "y": 4,
    "value": -1
  },
  {
    "hc-a2": [
      "СГДКБ"
    ],
    "name": "ГБУЗ АО \"СГДКБ\"",
    "id": 446,
    "x": 1,
    "y": 4,
    "value": -1
  },
  {
    "hc-a2": [
      "ССП"
    ],
    "name": "ГАУЗ Архангельской области \"Северодвинская стоматологическая поликлиника\"",
    "id": 458,
    "x": 0,
    "y": 4,
    "value": -1
  },
  {
    "hc-a2": [
      "СПД"
    ],
    "name": "ГБУЗ Архангельской области \"Северодвинский психоневрологический диспансер\"",
    "id": 483,
    "x": 3,
    "y": 4,
    "value": -1
  },
  {
    "hc-a2": [
      "СГБ1"
    ],
    "name": "ГБУЗ Архангельской области \"СГБ № 1\"",
    "id": 593,
    "x": 4,
    "y": 4,
    "value": -1
  },
]


// max_top "x": 2, "y": 2,
// max_left "x": -1, "y": ,
const region = [
  {
    "hc-a2": [
        "ПЛЕС"
    ],
    "name": "ГБУЗ Архангельской области \"Плесецкая ЦРБ\"",
    "id": 426,
    "x": 0,
    "y": 0,
    "value": -1
  },
  {
    "hc-a2": [
      "ШЕНК"
    ],
    "name": "ГБУЗ Архангельской области \"Шенкурская ЦРБ им. Н.Н. Приорова\"",
    "id": 499,
    "x": 1,
    "y": 0,
    "value": -1
  },
  {
    "hc-a2": [
        "ВИНО"
    ],
    "name": "ГБУЗ Архангельской области \"Виноградовская ЦРБ\"",
    "id": 545,
    "x": 1,
    "y": 1,
    "value": -1
  },
  {
    "hc-a2": [
        "МЦГБ"
    ],
    "name": "ГБУЗ Архангельской области \"МЦГБ\"",
    "id": 487,
    "x": 0,
    "y": 1,
    "value": -1
  },
  {
    "hc-a2": [
        "ОНЕЖ"
    ],
    "name": "ГБУЗ Архангельской области \"Онежская ЦРБ\"",
    "id": 557,
    "x": -1,
    "y": 2,
    "value": -1
  },
  {
    "hc-a2": [
        "КОНОШ"
    ],
    "name": "ГБУЗ Архангельской области \"Коношская центральная районная больница\"",
    "id": 437,
    "x": 0,
    "y": -1,
    "value": -1
  },
  {
    "hc-a2": [
        "ХОЛМ"
    ],
    "name": "ГБУЗ Архангельской области \"Холмогорская ЦРБ\"",
    "id": 443,
    "x": 1,
    "y": 2,
    "value": -1
  },
  {
    "hc-a2": [
        "КАРП"
    ],
    "name": "ГБУЗ Архангельской области \"Карпогорская ЦРБ\"",
    "id": 470,
    "x": 2,
    "y": 1,
    "value": -1
  },
  {
    "hc-a2": [
        "ЛЦРБ"
    ],
    "name": "ГБУЗ Архангельской области \"ЛЦРБ\"",
    "id": 490,
    "x": 3,
    "y": 2,
    "value": -1
  },
  {
    "hc-a2": [
        "МЦРБ"
    ],
    "name": "ГБУЗ АО \"МЦРБ\"",
    "id": 555,
    "x": 2,
    "y": 2,
    "value": -1
  },
  {
    "hc-a2": [
        "НЯНД"
    ],
    "name": "ГБУЗ АО \"Няндомская ЦРБ\"",
    "id": 496,
    "x": 0,
    "y": -2,
    "value": -1
  },
  {
    "hc-a2": [
        "ВЕРХ"
    ],
    "name": "ГБУЗ Архангельской области \"Верхнетоемская ЦРБ\"",
    "id": 586,
    "x": 1,
    "y": -1,
    "value": -1
  },
  {
    "hc-a2": [
        "КАРГ"
    ],
    "name": "ГБУЗ АО \"Каргопольская ЦРБ им. Н.Д. Кировой\"",
    "id": 492,
    "x": -1,
    "y": -2,
    "value": -1
  },
  {
    "hc-a2": [
        "ИЛЬИ"
    ],
    "name": "ГБУЗ Архангельской области \"Ильинская ЦРБ\"",
    "id": 468,
    "x": 2,
    "y": -3,
    "value": -1
  },
  {
    "hc-a2": [
        "УСТЬ"
    ],
    "name": "ГБУЗ Архангельской области \"Устьянская ЦРБ\"",
    "id": 531,
    "x": 2,
    "y": -4,
    "value": -1
  },
  {
    "hc-a2": [
        "ВЕЛЬ"
    ],
    "name": "ГБУЗ Архангельской области \"Вельская ЦРБ\"",
    "id": 605,
    "x": 1,
    "y": -2,
    "value": -1
  },
  {
    "hc-a2": [
        "ВСП"
    ],
    "name": "ГАУЗ АО \"ВСП\"",
    "id": 553,
    "x": 1,
    "y": -3,
    "value": -1
  },
  {
    "hc-a2": [
        "КРАСН"
    ],
    "name": "ГБУЗ Архангельской области \"Красноборская центральная районная больница\"",
    "id": 505,
    "x": 2,
    "y": -2,
    "value": -1
  },
  {
    "hc-a2": [
        "КГСП"
    ],
    "name": "ГАУЗ Архангельской области \"КГСП\"",
    "id": 578,
    "x": 3,
    "y": -3,
    "value": -1
  },
  {
      "hc-a2": [
          "КОТЛ"
      ],
      "name": "ГБУЗ Архангельской области \"Котласская ЦГБ\"",
      "id": 580,
      "x": 3,
      "y": -2,
      "value": -1
  },
  {
    "hc-a2": [
        "КПНД"
    ],
    "name": "ГБУЗ Архангельской области \"КПНД\"",
    "id": 584,
    "x": 3,
    "y": -1,
    "value": -1
  },
  {
    "hc-a2": [
        "КОРЯЖСП"
    ],
    "name": "ГАУЗ Архангельской области \"Коряжемская стоматологическая поликлиника\"",
    "id": 529,
    "x": 4,
    "y": -3,
    "value": -1
  },
  {
    "hc-a2": [
        "КОРЯЖ"
    ],
    "name": "ГБУЗ АО \"Коряжемская городская больница\"",
    "id": 566,
    "x": 4,
    "y": -2,
    "value": -1
  },
  {
    "hc-a2": [
        "ЯРЕН"
    ],
    "name": "ГБУЗ Архангельской области \"Яренская ЦРБ\"",
    "id": 542,
    "x": 5,
    "y": -1,
    "value": -1
  },
]

const arkhangelskRegion = [
    {
      "hc-a2": "АО",
      "name": "Архангельская область",
      "id": 417,
      "x": 8,
      "y": 0,
      "value": -1
  },
]

export const moMapDesktop = [
  ...arkhangelskRegion,
  ...arkhangelsk,
  ...severodvinsk,
  ...region,
]

export const moMapMobile = [
  ...arkhangelskRegion,
  ...arkhangelsk,
  ...severodvinsk,
  ...region,
]